###################################################################

# Created by write_sdc on Wed Mar 27 19:06:25 2024

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current uA
set_driving_cell -lib_cell INVX1 [get_ports clka]
set_driving_cell -lib_cell INVX1 [get_ports clkb]
set_driving_cell -lib_cell INVX1 [get_ports restart]
set_driving_cell -lib_cell INVX1 [get_ports {state[2]}]
set_driving_cell -lib_cell INVX1 [get_ports {state[1]}]
set_driving_cell -lib_cell INVX1 [get_ports {state[0]}]
set_driving_cell -lib_cell INVX1 [get_ports {board_in[31]}]
set_driving_cell -lib_cell INVX1 [get_ports {board_in[30]}]
set_driving_cell -lib_cell INVX1 [get_ports {board_in[29]}]
set_driving_cell -lib_cell INVX1 [get_ports {board_in[28]}]
set_driving_cell -lib_cell INVX1 [get_ports {board_in[27]}]
set_driving_cell -lib_cell INVX1 [get_ports {board_in[26]}]
set_driving_cell -lib_cell INVX1 [get_ports {board_in[25]}]
set_driving_cell -lib_cell INVX1 [get_ports {board_in[24]}]
set_driving_cell -lib_cell INVX1 [get_ports {board_in[23]}]
set_driving_cell -lib_cell INVX1 [get_ports {board_in[22]}]
set_driving_cell -lib_cell INVX1 [get_ports {board_in[21]}]
set_driving_cell -lib_cell INVX1 [get_ports {board_in[20]}]
set_driving_cell -lib_cell INVX1 [get_ports {board_in[19]}]
set_driving_cell -lib_cell INVX1 [get_ports {board_in[18]}]
set_driving_cell -lib_cell INVX1 [get_ports {board_in[17]}]
set_driving_cell -lib_cell INVX1 [get_ports {board_in[16]}]
set_driving_cell -lib_cell INVX1 [get_ports {board_in[15]}]
set_driving_cell -lib_cell INVX1 [get_ports {board_in[14]}]
set_driving_cell -lib_cell INVX1 [get_ports {board_in[13]}]
set_driving_cell -lib_cell INVX1 [get_ports {board_in[12]}]
set_driving_cell -lib_cell INVX1 [get_ports {board_in[11]}]
set_driving_cell -lib_cell INVX1 [get_ports {board_in[10]}]
set_driving_cell -lib_cell INVX1 [get_ports {board_in[9]}]
set_driving_cell -lib_cell INVX1 [get_ports {board_in[8]}]
set_driving_cell -lib_cell INVX1 [get_ports {board_in[7]}]
set_driving_cell -lib_cell INVX1 [get_ports {board_in[6]}]
set_driving_cell -lib_cell INVX1 [get_ports {board_in[5]}]
set_driving_cell -lib_cell INVX1 [get_ports {board_in[4]}]
set_driving_cell -lib_cell INVX1 [get_ports {board_in[3]}]
set_driving_cell -lib_cell INVX1 [get_ports {board_in[2]}]
set_driving_cell -lib_cell INVX1 [get_ports {board_in[1]}]
set_driving_cell -lib_cell INVX1 [get_ports {board_in[0]}]
set_driving_cell -lib_cell INVX1 [get_ports {curr_piece[1]}]
set_driving_cell -lib_cell INVX1 [get_ports {curr_piece[0]}]
create_clock [get_ports clka]  -period 50  -waveform {0 25}
set_input_delay -clock clka  1  [get_ports clkb]
set_input_delay -clock clka  1  [get_ports restart]
set_input_delay -clock clka  1  [get_ports {state[2]}]
set_input_delay -clock clka  1  [get_ports {state[1]}]
set_input_delay -clock clka  1  [get_ports {state[0]}]
set_input_delay -clock clka  1  [get_ports {board_in[31]}]
set_input_delay -clock clka  1  [get_ports {board_in[30]}]
set_input_delay -clock clka  1  [get_ports {board_in[29]}]
set_input_delay -clock clka  1  [get_ports {board_in[28]}]
set_input_delay -clock clka  1  [get_ports {board_in[27]}]
set_input_delay -clock clka  1  [get_ports {board_in[26]}]
set_input_delay -clock clka  1  [get_ports {board_in[25]}]
set_input_delay -clock clka  1  [get_ports {board_in[24]}]
set_input_delay -clock clka  1  [get_ports {board_in[23]}]
set_input_delay -clock clka  1  [get_ports {board_in[22]}]
set_input_delay -clock clka  1  [get_ports {board_in[21]}]
set_input_delay -clock clka  1  [get_ports {board_in[20]}]
set_input_delay -clock clka  1  [get_ports {board_in[19]}]
set_input_delay -clock clka  1  [get_ports {board_in[18]}]
set_input_delay -clock clka  1  [get_ports {board_in[17]}]
set_input_delay -clock clka  1  [get_ports {board_in[16]}]
set_input_delay -clock clka  1  [get_ports {board_in[15]}]
set_input_delay -clock clka  1  [get_ports {board_in[14]}]
set_input_delay -clock clka  1  [get_ports {board_in[13]}]
set_input_delay -clock clka  1  [get_ports {board_in[12]}]
set_input_delay -clock clka  1  [get_ports {board_in[11]}]
set_input_delay -clock clka  1  [get_ports {board_in[10]}]
set_input_delay -clock clka  1  [get_ports {board_in[9]}]
set_input_delay -clock clka  1  [get_ports {board_in[8]}]
set_input_delay -clock clka  1  [get_ports {board_in[7]}]
set_input_delay -clock clka  1  [get_ports {board_in[6]}]
set_input_delay -clock clka  1  [get_ports {board_in[5]}]
set_input_delay -clock clka  1  [get_ports {board_in[4]}]
set_input_delay -clock clka  1  [get_ports {board_in[3]}]
set_input_delay -clock clka  1  [get_ports {board_in[2]}]
set_input_delay -clock clka  1  [get_ports {board_in[1]}]
set_input_delay -clock clka  1  [get_ports {board_in[0]}]
set_input_delay -clock clka  1  [get_ports {curr_piece[1]}]
set_input_delay -clock clka  1  [get_ports {curr_piece[0]}]
set_output_delay -clock clka  1  [get_ports {board_out[31]}]
set_output_delay -clock clka  1  [get_ports {board_out[30]}]
set_output_delay -clock clka  1  [get_ports {board_out[29]}]
set_output_delay -clock clka  1  [get_ports {board_out[28]}]
set_output_delay -clock clka  1  [get_ports {board_out[27]}]
set_output_delay -clock clka  1  [get_ports {board_out[26]}]
set_output_delay -clock clka  1  [get_ports {board_out[25]}]
set_output_delay -clock clka  1  [get_ports {board_out[24]}]
set_output_delay -clock clka  1  [get_ports {board_out[23]}]
set_output_delay -clock clka  1  [get_ports {board_out[22]}]
set_output_delay -clock clka  1  [get_ports {board_out[21]}]
set_output_delay -clock clka  1  [get_ports {board_out[20]}]
set_output_delay -clock clka  1  [get_ports {board_out[19]}]
set_output_delay -clock clka  1  [get_ports {board_out[18]}]
set_output_delay -clock clka  1  [get_ports {board_out[17]}]
set_output_delay -clock clka  1  [get_ports {board_out[16]}]
set_output_delay -clock clka  1  [get_ports {board_out[15]}]
set_output_delay -clock clka  1  [get_ports {board_out[14]}]
set_output_delay -clock clka  1  [get_ports {board_out[13]}]
set_output_delay -clock clka  1  [get_ports {board_out[12]}]
set_output_delay -clock clka  1  [get_ports {board_out[11]}]
set_output_delay -clock clka  1  [get_ports {board_out[10]}]
set_output_delay -clock clka  1  [get_ports {board_out[9]}]
set_output_delay -clock clka  1  [get_ports {board_out[8]}]
set_output_delay -clock clka  1  [get_ports {board_out[7]}]
set_output_delay -clock clka  1  [get_ports {board_out[6]}]
set_output_delay -clock clka  1  [get_ports {board_out[5]}]
set_output_delay -clock clka  1  [get_ports {board_out[4]}]
set_output_delay -clock clka  1  [get_ports {board_out[3]}]
set_output_delay -clock clka  1  [get_ports {board_out[2]}]
set_output_delay -clock clka  1  [get_ports {board_out[1]}]
set_output_delay -clock clka  1  [get_ports {board_out[0]}]
set_output_delay -clock clka  1  [get_ports error]
